app/Controllers/Notes.php

    public function index()
    {
        $allNotes = $this->notes->findAll();
---
SELECT *
FROM `notes`

    public function view($id = false)
    {
        $data = $this->notes->find($id);
---
SELECT *
FROM `notes`
WHERE `notes`.`id` = '32'

    public function store()
    {
        $data = [
            'title' => $this->request->getVar('title'),
            'text' => $this->request->getVar('text'),
        ];
        $noteId = $this->notes->insert($data);
        $saved = $this->notes->find($noteId);
---
INSERT INTO `notes` (`title`, `text`, `created_at`, `updated_at`) VALUES ('Catatan 2', 'tes', '2024-04-21 12:18:21', '2024-04-21 12:18:21')
SELECT *
FROM `notes`
WHERE `notes`.`id` = 33

    public function update($id)
    {
        $data = [
            'title' => $this->request->getVar('title'),
            'text' => $this->request->getVar('text'),
        ];

        $result = $this->notes->update($id, $data);
---
UPDATE `notes` SET `title` = 'Catatan 1', `text` = ' isc 2024 web programming 2', `updated_at` = '2024-04-21 12:18:44'
WHERE `notes`.`id` IN ('32')

    public function delete($id)
    {
        if ($id === null) {
            return redirect()->back()->with('error', 'Note ID is missing');
        }

        $result = $this->notes->delete($id);
---
DELETE FROM `notes`
WHERE `id` IN ('32')